Masmiseim36/nxpSDK/devices/MKW39A4/drivers/fsl_i2c.c
    /* Setup the I2C peripheral to transmit data. */
    base->C1 |= I2C_C1_TX_MASK;

    while (0U != (txSize--))
    {
        /* Send a byte of data. */
        base->D = *txBuff++;

        /* Wait until data transfer complete. */
        result = I2C_WaitForStatusReady(base, (uint8_t)kI2C_IntPendingFlag);
        if (result != 0)
        {
            return result;
        }

        statusFlags = base->S;

        /* Clear the IICIF flag. */
        base->S = (uint8_t)kI2C_IntPendingFlag;

        /* Check if arbitration lost or no acknowledgement (NAK), return failure status. */
        if (0U != (statusFlags & (uint8_t)kI2C_ArbitrationLostFlag))
        {
            base->S = (uint8_t)kI2C_ArbitrationLostFlag;
            result  = kStatus_I2C_ArbitrationLost;
        }

        if ((0U != (statusFlags & (uint8_t)kI2C_ReceiveNakFlag)) && (0U != txSize))
        {
            base->S = (uint8_t)kI2C_ReceiveNakFlag;
            result  = kStatus_I2C_Nak;
        }

        if (result != kStatus_Success)
        {
            /* Breaking out of the send loop. */
            break;
        }
    }

    if (((result == kStatus_Success) && (0U == (flags & (uint32_t)kI2C_TransferNoStopFlag))) ||
        (result == kStatus_I2C_Nak))
    {
        /* Clear the IICIF flag. */
        base->S = (uint8_t)kI2C_IntPendingFlag;

        /* Send stop. */
        result = I2C_MasterStop(base);
    }

    return result;
}

/*!
 * brief Performs a polling receive transaction on the I2C bus.
 *
 * note The I2C_MasterReadBlocking function stops the bus before reading the final byte.
 * Without stopping the bus prior for the final read, the bus issues another read, resulting
 * in garbage data being read into the data register.
 *
 * param base I2C peripheral base pointer.
 * param rxBuff The pointer to the data to store the received data.
 * param rxSize The length in bytes of the data to be received.
 * param flags Transfer control flag to decide whether need to send a stop, use kI2C_TransferDefaultFlag
 *  to issue a stop and kI2C_TransferNoStop to not send a stop.
 * retval kStatus_Success Successfully complete the data transmission.
 * retval kStatus_I2C_Timeout Send stop signal failed, timeout.
 */
status_t I2C_MasterReadBlocking(I2C_Type *base, uint8_t *rxBuff, size_t rxSize, uint32_t flags)
{
    status_t result = kStatus_Success;

#if defined(I2C_MASTER_FACK_CONTROL) && I2C_MASTER_FACK_CONTROL
    base->SMB |= I2C_SMB_FACK_MASK;
#endif

    /* Wait until the data register is ready for transmit. */
    result = I2C_WaitForStatusReady(base, (uint8_t)kI2C_TransferCompleteFlag);
    if (result != 0)
    {
        return result;
    }

    /* Setup the I2C peripheral to receive data. */
    base->C1 &= ~(uint8_t)(I2C_C1_TX_MASK | I2C_C1_TXAK_MASK);

    /* Read data to release the bus. */
    (void)base->D;

    if (rxSize == 1U)
    {
        /* Issue NACK on read. */
        base->C1 |= I2C_C1_TXAK_MASK;
#if defined(I2C_MASTER_FACK_CONTROL) && I2C_MASTER_FACK_CONTROL
        base->SMB &= ~(uint8_t)I2C_SMB_FACK_MASK;
#endif
    }

    /* Clear the IICIF flag. */
    base->S = (uint8_t)kI2C_IntPendingFlag;

    while (0U != (rxSize--))
    {
        /* Wait until data transfer complete. */
        result = I2C_WaitForStatusReady(base, (uint8_t)kI2C_IntPendingFlag);
        if (result != 0)
        {
            return result;
        }

        if (rxSize == 0U)
        {
            if (0U == (flags & (uint32_t)kI2C_TransferNoStopFlag))
            {
                /* Issue STOP command before reading last byte. */
                result = I2C_MasterStop(base);
            }
            else
            {
                /* Change direction to Tx to avoid extra clocks. */
                base->C1 |= I2C_C1_TX_MASK;
            }
        }

        /* Read from the data register. */
        *rxBuff++ = base->D;

#if defined(I2C_MASTER_FACK_CONTROL) && I2C_MASTER_FACK_CONTROL
        if (rxSize != 0U)
        {
            /* Clear the TXAK flag. */
            base->C1 &= ~(uint8_t)I2C_C1_TXAK_MASK;

            for (uint32_t i = (SystemCoreClock / (2U * g_baudrate)); i > 0U; i--)
            {
                __NOP();
            }

            /* Read data to release the bus. */
            (void)base->D;
        }
#endif

        if (rxSize == 1U)
        {
            base->C1 |= I2C_C1_TXAK_MASK;
#if defined(I2C_MASTER_FACK_CONTROL) && I2C_MASTER_FACK_CONTROL
            /* Issue NACK on read. */
            base->SMB &= ~(uint8_t)I2C_SMB_FACK_MASK;
#endif
        }

        /* Clear the IICIF flag. */
        base->S = (uint8_t)kI2C_IntPendingFlag;
    }

    return result;
}

/*!
 * @brief Master checks bus status after sending out address.
 *
 * @param base I2C peripheral base address.
 * @retval kStatus_Success Successfully complete the address transmission.
 * @retval kStatus_I2C_Timeout Transfer error, wait signal timeout.
 * @retval kStatus_I2C_Addr_Nak Transfer error, receive NAK during transfer.
 */
static status_t I2C_MasterCheckAddrNack(I2C_Type *base)
{
    status_t result = (status_t)kStatus_Success;

    /* Wait until data transfer complete. */
    result = I2C_WaitForStatusReady(base, (uint8_t)kI2C_IntPendingFlag);
    if (result != 0)
    {
        return result;
    }

    /* Check if there's transfer error. */
    result = I2C_CheckAndClearError(base, base->S);

    /* Return if error. */
    if (0 != result)
    {
        if (result == (status_t)kStatus_I2C_Nak)
        {
            result = (status_t)kStatus_I2C_Addr_Nak;

            (void)I2C_MasterStop(base);
        }
    }
    return result;
}

status_t I2C_MasterHandleStartCondition(I2C_Type *base, i2c_master_transfer_t *xfer)
{
    status_t result           = kStatus_Success;
    i2c_direction_t direction = xfer->direction;
    /* Change to send write address when it's a read operation with command. */
    if ((xfer->subaddressSize > 0U) && (xfer->direction == kI2C_Read))
    {
        direction = kI2C_Write;
    }

    /* Handle no start option, only support write with no start signal. */
    if (0U != (xfer->flags & (uint32_t)kI2C_TransferNoStartFlag))
    {
        if (direction == kI2C_Read)
        {
            result = kStatus_InvalidArgument;
        }
    }
    /* If repeated start is requested, send repeated start. */
    else if (0U != (xfer->flags & (uint32_t)kI2C_TransferRepeatedStartFlag))
    {
        result = I2C_MasterRepeatedStart(base, xfer->slaveAddress, direction);
    }
    else /* For normal transfer, send start. */
    {
        result = I2C_MasterStart(base, xfer->slaveAddress, direction);
    }

    return result;
}

/*!
 * brief Performs a master polling transfer on the I2C bus.
 *
 * note The API does not return until the transfer succeeds or fails due
 * to arbitration lost or receiving a NAK.
 *
 * param base I2C peripheral base address.
 * param xfer Pointer to the transfer structure.
 * retval kStatus_Success Successfully complete the data transmission.
 * retval kStatus_I2C_Busy Previous transmission still not finished.
 * retval kStatus_I2C_Timeout Transfer error, wait signal timeout.
 * retval kStatus_I2C_ArbitrationLost Transfer error, arbitration lost.
 * retval kStataus_I2C_Nak Transfer error, receive NAK during transfer.
 */
status_t I2C_MasterTransferBlocking(I2C_Type *base, i2c_master_transfer_t *xfer)
{
    assert(NULL != xfer);

    status_t result = kStatus_Success;

    /* Clear all status before transfer. */
    I2C_MasterClearStatusFlags(base, (uint32_t)kClearFlags);

    /* Wait until the data register is ready for transmit. */
    result = I2C_WaitForStatusReady(base, (uint8_t)kI2C_TransferCompleteFlag);
    if (result != 0)
    {
        return result;
    }

    result = I2C_MasterHandleStartCondition(base, xfer);
    if (result != 0)
    {
        return result;
    }

    if (0U == (xfer->flags & (uint32_t)kI2C_TransferNoStartFlag))
    {
        /* Wait until data transfer complete and check if there's transfer error. */
        result = I2C_MasterCheckAddrNack(base);
        if (result != 0)
        {
            return result;
        }
    }

    /* Send subaddress. */
    if (0U != (xfer->subaddressSize))
    {
        do
        {
            /* Clear interrupt pending flag. */
            base->S = (uint8_t)kI2C_IntPendingFlag;

