Masmiseim36/nxpSDK/devices/MKW39A4/drivers/fsl_i2c.c
        /* Set up event mask. tx and rx are always enabled. */
        handle->eventMask = eventMask | (uint32_t)kI2C_SlaveTransmitEvent | (uint32_t)kI2C_SlaveReceiveEvent |
                            (uint32_t)kI2C_SlaveGenaralcallEvent;

        /* Clear all flags. */
        I2C_SlaveClearStatusFlags(base, (uint32_t)kClearFlags);

        /* Enable I2C internal IRQ sources. NVIC IRQ was enabled in CreateHandle() */
        I2C_EnableInterrupts(base, (uint32_t)kIrqFlags);
    }

    return kStatus_Success;
}

/*!
 * brief Aborts the slave transfer.
 *
 * note This API can be called at any time to stop slave for handling the bus events.
 *
 * param base I2C base pointer.
 * param handle pointer to i2c_slave_handle_t structure which stores the transfer state.
 */
void I2C_SlaveTransferAbort(I2C_Type *base, i2c_slave_handle_t *handle)
{
    assert(NULL != handle);

    if (true == handle->isBusy)
    {
        /* Disable interrupts. */
        I2C_DisableInterrupts(base, (uint32_t)kIrqFlags);

        /* Reset transfer info. */
        (void)memset(&handle->transfer, 0, sizeof(handle->transfer));

        /* Reset the state to idle. */
        handle->isBusy = false;
    }
}

/*!
 * brief Gets the slave transfer remaining bytes during a interrupt non-blocking transfer.
 *
 * param base I2C base pointer.
 * param handle pointer to i2c_slave_handle_t structure.
 * param count Number of bytes transferred so far by the non-blocking transaction.
 * retval kStatus_InvalidArgument count is Invalid.
 * retval kStatus_Success Successfully return the count.
 */
status_t I2C_SlaveTransferGetCount(I2C_Type *base, i2c_slave_handle_t *handle, size_t *count)
{
    assert(NULL != handle);

    if (NULL == count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (false == handle->isBusy)
    {
        *count = 0;
        return kStatus_NoTransferInProgress;
    }

    /* For an active transfer, just return the count from the handle. */
    *count = handle->transfer.transferredCount;

    return kStatus_Success;
}

#ifdef I2C_HAS_STOP_DETECT
static void I2C_SlaveHandleStopDetect(I2C_Type *base, i2c_slave_handle_t *handle)
{
    i2c_slave_transfer_t *xfer = &(handle->transfer);
    uint32_t eventMask         = handle->eventMask;

    I2C_MasterClearStatusFlags(base, (uint32_t)kI2C_StopDetectFlag);

    /* Clear the interrupt flag. */
    base->S = (uint8_t)kI2C_IntPendingFlag;

    /* Call slave callback if this is the STOP of the transfer. */
    if (true == handle->isBusy)
    {
        xfer->event            = kI2C_SlaveCompletionEvent;
        xfer->completionStatus = (status_t)kStatus_Success;
        handle->isBusy         = false;

        if ((0U != (eventMask & (uint32_t)xfer->event)) && (NULL != handle->callback))
        {
            handle->callback(base, xfer, handle->userData);
        }
    }
}
#endif /* I2C_HAS_STOP_DETECT */

#if defined(FSL_FEATURE_I2C_HAS_START_STOP_DETECT) && FSL_FEATURE_I2C_HAS_START_STOP_DETECT
static void I2C_SlaveHandleStartDetect(I2C_Type *base, i2c_slave_handle_t *handle)
{
    i2c_slave_transfer_t *xfer = &(handle->transfer);
    uint32_t eventMask         = handle->eventMask;

    I2C_MasterClearStatusFlags(base, (uint32_t)kI2C_StartDetectFlag);

    /* Clear the interrupt flag. */
    base->S = (uint8_t)kI2C_IntPendingFlag;

    xfer->event = kI2C_SlaveStartEvent;

    if ((0U != (eventMask & (uint32_t)xfer->event)) && (NULL != handle->callback))
    {
        handle->callback(base, xfer, handle->userData);
    }
}
#endif /* FSL_FEATURE_I2C_HAS_START_STOP_DETECT */

static void I2C_SlaveHandleReceiveNack(I2C_Type *base, i2c_slave_handle_t *handle)
{
    i2c_slave_transfer_t *xfer = &(handle->transfer);
    uint32_t eventMask         = handle->eventMask;

    /* Set receive mode. */
    base->C1 &= ~(uint8_t)(I2C_C1_TX_MASK | I2C_C1_TXAK_MASK);

    /* Read data. */
    (void)base->D;

    if (handle->transfer.dataSize != 0u)
    {
        xfer->event            = kI2C_SlaveCompletionEvent;
        xfer->completionStatus = (status_t)kStatus_I2C_Nak;
        handle->isBusy         = false;

        if ((0U != (eventMask & (uint32_t)xfer->event)) && (NULL != handle->callback))
        {
            handle->callback(base, xfer, handle->userData);
        }
    }
    else
    {
#ifndef I2C_HAS_STOP_DETECT
        xfer->event            = kI2C_SlaveCompletionEvent;
        xfer->completionStatus = (status_t)kStatus_Success;
        handle->isBusy         = false;

        if ((0U != (eventMask & (uint32_t)xfer->event)) && (NULL != handle->callback))
        {
            handle->callback(base, xfer, handle->userData);
        }
#endif /* !FSL_FEATURE_I2C_HAS_START_STOP_DETECT or !FSL_FEATURE_I2C_HAS_STOP_DETECT */
    }
}

static void I2C_SlaveHandleReceiveComplete(I2C_Type *base, i2c_slave_handle_t *handle)
{
    i2c_slave_transfer_t *xfer = &(handle->transfer);

    /* If we're out of data, invoke callback to get more. */
    if ((NULL == xfer->data) || (0U == xfer->dataSize))
    {
        xfer->event = kI2C_SlaveReceiveEvent;

        if (NULL != handle->callback)
        {
            handle->callback(base, xfer, handle->userData);
        }

        /* Clear the transferred count now that we have a new buffer. */
        xfer->transferredCount = 0;
    }

    /* Slave receive, master writing to slave. */
    uint8_t data = base->D;

    if (0U != (handle->transfer.dataSize--))
    {
        /* Receive data. */
        *handle->transfer.data++ = data;
        xfer->transferredCount++;
        if (0U == handle->transfer.dataSize)
        {
#ifndef I2C_HAS_STOP_DETECT
            xfer->event            = kI2C_SlaveCompletionEvent;
            xfer->completionStatus = kStatus_Success;
            handle->isBusy         = false;

            /* Proceed receive complete event. */
            if ((handle->eventMask & (uint32_t)xfer->event) && (handle->callback))
            {
                handle->callback(base, xfer, handle->userData);
            }
#endif /* !FSL_FEATURE_I2C_HAS_START_STOP_DETECT or !FSL_FEATURE_I2C_HAS_STOP_DETECT */
        }
    }
}

/*!
 * brief Slave interrupt handler.
 *
 * param base I2C base pointer.
 * param i2cHandle pointer to i2c_slave_handle_t structure which stores the transfer state
 */
void I2C_SlaveTransferHandleIRQ(I2C_Type *base, void *i2cHandle)
{
    assert(NULL != i2cHandle);

    uint16_t status;
    bool doTransmit            = false;
    i2c_slave_handle_t *handle = (i2c_slave_handle_t *)i2cHandle;
    i2c_slave_transfer_t *xfer = &(handle->transfer);
    uint32_t eventMask         = handle->eventMask;
    size_t tmpDataSize;

    status = (uint16_t)I2C_SlaveGetStatusFlags(base);

#ifdef I2C_HAS_STOP_DETECT
    /* Check stop flag. */
    if (0U != (status & (uint16_t)kI2C_StopDetectFlag))
    {
        I2C_SlaveHandleStopDetect(base, handle);

